package ua.mm.classwork13;

public class Guitar implements Instruments, SomeInt {
	public void getSound() {
	}
	//класс может реализовать множество интерфейсов, но наследовать - только 1 абстрактный класс
	//интерфейс содержит только public final static , а абстрактный класс может содержать любые поля
	//в интерфейсах модификаторы только public и abstract, а к абстрактным членам класса применяются любые модификаторы
	//абстрактный класс может содержать реализацию методов, а интерфейс - нет
	//абстрактный класс может содержать конструктор, который будет выполняться
	
	
	
	
	public void someGet() {
		
	}
}
