package ua.mm.classwork7;
//Создать три класса - круг, квадрат, треугольник. Каждый класс должен содержать информацию о том, какая он фигура,
//2. Цвет 3. Периметр 4. Площадь. Метод сетСквер, сетКолор, сетПлощадь, гет инфо. Цвет - отдельный класс, рандомно выджает один из 10 цветов 

public class Less7 {


	public static void main(String[] args) {
		/*label1:
		for (int j=0; j<3; j++)
		for (int i=0; i<5; i++){						GOTO
			if(i==3)break label1;
			System.out.println("j="+j+";"+"i="+i+";");
		}*/
		Less7Add preint = new Less7Add();
		preint.printVar(12.1);
	}

}
